Revit 2027 API
BuiltInFailures.ElementTypeFailures.NoDefaultType Property
 As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoDefaultType { get; }
Public Shared ReadOnly Property NoDefaultType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoDefaultType {
	FailureDefinitionId^ get ();
}
static member NoDefaultType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElementTypeFailures Class
Autodesk.Revit.DB Namespace